In [1]:
%matplotlib inline

# Import dependencies
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# Import data 
city_data_to_load = '/content/drive/My Drive/Colab Notebooks/PyBer_Analysis/Resources/city_data.csv'
ride_data_to_load = '/content/drive/My Drive/Colab Notebooks/PyBer_Analysis/Resources/ride_data.csv'

In [3]:
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [4]:
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [9]:
# Get the columns and rows that are not null
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [10]:
# Get the data types for each column
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [12]:
# Get the unique values of the type of city
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [18]:
# Get the number of data points from urban cities
sum(city_data_df['type'] == 'Rural')

18

In [19]:
# Get the columns and rows that are not null
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [20]:
# Get the data types for each column
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [22]:
# Merge DataFrames
pyber_complete_df = pd.merge(ride_data_df, city_data_df, how='left', on=['city', 'city'])
pyber_complete_df.head(10)

                 city                 date  ...  driver_count   type
0  Lake Jonathanshire  2019-01-14 10:14:22  ...             5  Urban
1  South Michelleport  2019-03-04 18:24:09  ...            72  Urban
2  Port Samanthamouth  2019-02-24 04:29:00  ...            57  Urban
3          Rodneyfort  2019-02-10 23:22:03  ...            34  Urban
4          South Jack  2019-03-06 04:28:35  ...            46  Urban
5        South Latoya  2019-03-11 12:26:48  ...            10  Urban
6       New Paulville  2019-02-27 11:17:56  ...            44  Urban
7        Simpsonburgh  2019-04-26 00:43:24  ...            21  Urban
8     South Karenland  2019-01-08 03:28:48  ...             4  Urban
9       North Jasmine  2019-03-09 06:26:29  ...            33  Urban

[10 rows x 6 columns]